philosophy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Philosophy Resources</title>
<!-- 2023-03-21 Tue 00:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Evan James McCarter" />
</head>
<body>
<div id="content">
<h1 class="title">Philosophy Resources</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A Definition of Life</a></li>
<li><a href="#sec-2">2. Embracing Ignorance</a>
<ul>
<li><a href="#sec-2-1">2.1. Help Life flourish</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Long term accomplishments</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Communal Ethics</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Videos</a></li>
<li><a href="#sec-4">4. Books</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A Definition of Life</h2>
<div class="outline-text-2" id="text-1">
<p>
I define "A Living Thing" as "A system that grows and then splits into multiple independent parts". For example, a bacteria grows larger, then splits into two bacteria, and both can continue to reproduce even if they are separated by a great distance. Human beings become pregnant, grow in mass, give birth, and children eventually become independent agents that can continue to reproduce even when their parents and siblings are absent. 
</p>

<p>
Incidentally, this suggests that virus particles are not alive (they do not grow, they only move towards ribosomes in other living cells), but that <span class="underline">infections</span> <b>are</b> alive: they grow in number and mass of virus particles and occupy ever larger geographical areas, and two isolated areas can have infections that are equally able to spread and can survive independent of the other's existence. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Embracing Ignorance</h2>
<div class="outline-text-2" id="text-2">
<p>
In software engineering there is a concept of "suitability for a particular purpose". 
</p>

<p>
Is (human) consciousness suited for a particular purpose? 
</p>

<p>
Clearly humans are not well suited to independently understand ethics. However, human consciousness <span class="underline">is</span> well suited for preserving the existence of life, including non-human life since we depend on it so greatly (consider EG corn, gut bacteria, dogs, horses, trees, etc). 
</p>

<p>
Having accepted that I will likely constantly be faced with ethical challenges I am unable to solve independently, I have rejected the responsibility to personally produce an ethical system that explains everything, and I am faced with multiple options to choose from for an overarching life goal. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Help Life flourish</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The goal I have been operating under for several years without incident is "to ensure that at least one Living Thing exists at as many points in time as possible". This may end up as merely a colony of bacteria living on a spaceship orbiting a black hole, but even that would give the survivors a chance to take advantage of any new energy sources that appear in the universe unexpectedly. 
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Long term accomplishments</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
An ideal way to accomplish this goal would be to find a way to reverse entropy in a given area of space. Then we could set up a system where we cause matter to gain momentum or manufacture new particles, where the increase in energy or mass is greater than the inputs we provide, then collect the particles that carry the "free" energy for use elsewhere. If this can be done at a massive scale, producing many undecillions of kilograms of matter or the equivalent in energy, it may be energy efficient to continuously construct black holes with the output of the area of reversed entropy, as dropping matter into black holes makes a large amount of energy available surprisingly: <a href="https://www.youtube.com/watch?v=ulCdoCfw-bY">https://www.youtube.com/watch?v=ulCdoCfw-bY</a> 
</p>

<p>
In the short term, colonizing Mars or Mercury (<a href="https://www.einstein-schrodinger.com/mercury_colony.html">https://www.einstein-schrodinger.com/mercury_colony.html</a>) or Venus (<a href="https://www.youtube.com/watch?v=G-WO-z-QuWI">https://www.youtube.com/watch?v=G-WO-z-QuWI</a>), or at least a Moon or setting up a permanent colony at a Lagrange point, would be an excellent start. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Communal Ethics</h3>
<div class="outline-text-3" id="text-2-2">
<p>
It may be possible to engage in religious, civic, and state institutions such that the interactions between many conscious beings will produce more ethical results than one individual acting alone. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Videos</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://www.youtube.com/user/JordanPetersonVideos">Jordan B. Peterson</a>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=f-wWBGo6a2w&list=PL22J3VaeABQD_IZs7y60I3lUrrFTzkpat">Discovering how to live a good Life through biblical analysis</a>
</li>
</ul>
</li>
<li><a href="https://www.youtube.com/watch?v=BNYJQaZUDrI&list=PL8dPuuaLjXtNgK6MZucdYldNkMybYIHKR&index=1">CrashCourse Philosophy playlist</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Books</h2>
<div class="outline-text-2" id="text-4">
<p>
These books are frequently available as audiobooks on YouTube &amp; the authors may have channels, as well as physical or digital forms on Amazon or at your local library
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Title</th>
<th scope="col" class="left">Author</th>
<th scope="col" class="right">ISBN</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="https://YouTube.com/watch?v=ZUbfskQ-GAY">Think and Grow Rich</a></td>
<td class="left">Napoleon Hill</td>
<td class="right">978-1585424337</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan James McCarter</p>
<p class="date">Created: 2023-03-21 Tue 00:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
